// ignore_for_file: prefer_const_constructors, prefer_const_literals_to_create_immutables, unused_import

import 'package:flutter/material.dart';
import 'package:getapi/utills/History_places.dart';
import 'package:google_nav_bar/google_nav_bar.dart';

import '../utills/popular_places_list.dart';

class HistoryPage extends StatefulWidget {
  const HistoryPage({Key? key}) : super(key: key);

  @override
  _HistoryPageState createState() => _HistoryPageState();
}

class _HistoryPageState extends State<HistoryPage> {
  @override
  Widget build(BuildContext context) {
    return Scaffold(
      
      body: SafeArea(
        child: Padding(
          padding: const EdgeInsets.all(8.0),
          child: Column(
            children: [
              SizedBox(
                height: 5,
              ),
              Expanded(
                child: ListView(
                  scrollDirection: Axis.vertical,
                  children: [
                    Column(
                      children: [
                        Card(
                          child: Image.asset('assets/images/lpb2.jpg'),
                        ),
                        Card(
                          child: Text(
                              'ເມືອງຫລວງພະບາງສ້າງຕັ້ງຂື້ນກ່ອນໜ້ານີ້ປະມານ 1.200 ປີ, ໂດຍການໄຫຼພົບກັນລະຫວ່າງແມ່ນໍ້າຄານ ແລະແມ່ນໍ້າຂອງຢູ່ໃນໃຈກາງພາກເໜືອຂອງລາວ. ຫຼວງພະບາງເປັນທັງເມືອງຫຼວງຂອງອານາຈັກບູຮານ ແລະ ຍຸກສະໄໝໃໝ່.ຊື່ເດີມຂອງຫຼວງພະບາງປະກອບມີຫຼາຍຊື່ເຊັ່ນ: ເມືອງຊວາ, ຊຽງທອງ ແລະລ້ານຊ້າງ; ຊື່ເມືອງໃນປະຈຸບັນແມ່ນໄດ້ມາຈາກຊື່ຂອງພະພຸດທະຮູບພະບາງ, ພະບາງແມ່ນຮູບພະພຸດທະຮູບທີ່ສັກສິດ ແລະເປັນທີ່ເຄົາລົບບູຊາຂອງປະຊາຊົນ ເຊິ່ງໄດ້ປະດິດສະຖານຢູ່ໃນຫໍພິພິທະພັນແຫ່ງຊາດໃນໃຈກາງເມືອງປັດຈຸບັນຫຼວງພະບາງເປັນທີ່ຮູ້ຈັກກັນດີໃນການດູແລຮັກສາຄວາມເປັນເອກະລັກສະເພາະຂອງວັດ ສະຖາປັດຕະຍະກຳ ແບບດັ້ງເດີມ ອາຄານອານານິຄົມ ແລະຄວາມສວຍງາມແບບທຳມະຊາດອ້ອມຂ້າງແຂວງ. ເຖິງແມ່ນວ່າເມືອງຫລວງພະບາງເປັນເມືອງທີ່ຕ້ອນຮັບນັກທ່ອງທ່ຽວຈາກທົ່ວທຸກມຸມໂລກ ແຕ່ມັນຍັງມີຄວາມສຳຄັນທາງດ້ານການເມືອງ, ການສຶກສາ ແລະເປັນສູນກາງການຄ້າທີ່ ສຳຄັນສຳລັບວັດທະນາທຳ ຫຼາຍປະເທດໃນພາກເໜືອຂອງລາວ.ຕະຫຼາດເຊົ້າຂອງຫຼວງພະບາງ ບ່ອນທີ່ທ່ານສາມາດພົບເຫັດປ່າສົດໆຈາກພູເຂົາໃກ້ໆ ແຜ່ນແພທີ່ເຮັດດ້ວຍມືທີ່ເປັນເອກະ ລັກສະເພາະ ແລະມັນແມ່ນສະຖານທີ່ທ້ອງຖິ່ນທີ່ຈະຊື້ສ່ວນປະກອບໃນການປຸງອາຫານ. ເມືອງນີ້ເຕັມໄປດ້ວຍບັນດາວັດວາອາຮາມທີ່ສວຍງາມເຊັ່ນ: ວັດຊຽງທອງ, ວັດໃໝ່ ແລະວັດວິຊຸນ, ມະຫາວິທະຍາໄລສຸພານຸວົງ ແລະວິທະຍາໄລຄູທີ່ ສຳຄັນໃນປະຈຸບັນເຊັ່ນດຽວກັບຫໍພິພິທະພັນແຫ່ງຊາດ. ນອກຈາກນີ້ຍັງມີເຮືອຈັກ ແລະຊາວປະມົງອາໄສຢູ່ລຽບຕາມແມ່ນໍ້າຂອງ ລວມທັງເຮືອບິນລົງຈອດຢູ່ສະໜາມບິນສາກົນຫຼວງພະບາງ, ເປັນເມືອງທີ່ແຕກຕ່າງໃນເມື່ອກ່ອນ ແຕ່ບໍ່ທຳ ລາຍປະຫວັດສາດ ແລະປະເພນີແຂວງຫຼວງພະບາງຕັ້ງຢູ່ພາກກາງຂອງພາກເໜືອຂອງປະເທດລາວ, ຕິດກັບແຂວງອຸດົມໄຊ, ຜົ້ງສາລີ ແລະຫົວພັນໄປທາງທິດເໜືອ, ນະຄອນຫຼວງວຽງຈັນ ແລະໄຊຍະບູລີ ໄປທາງທິດໃຕ້ ແລະທິດຕາເວັນຕົກສຽງໃຕ້, ແຂວງຊຽງຂວາງໄປທາງທິດຕາເວັນອອກແຂວງຫຼວງພະບາງມີປະຊາກອນຫຼາຍກ່ວາ 400,000 ຄົນ, ໃນນັ້ນມີ 8 ຊົນເຜົ່າແຕກຕ່າງກັນ. ຊົນເຜົ່າກືມມຸມັກຈະສະກົດວ່າຂະມຸ ເປັນຊົນເຜົ່າທີ່ໃຫ່ຍທີ່ສຸດໃນແຂວງ ແລະມີປະຊາກອນສ່ວນໃຫ່ຍກວມເອົາປະມານ 44% ຂອງປະຊາ ກອນທັງໝົດ, ຊົນເຜົ່າມົ້ງແມ່ນອັນດັບສອງຂອງຊົນເຜົ່າສ່ວນນ້ອຍກວມ (16%), ໃນເຂດທົ່ງພຽງເຜົ່າລາວລຸ່ມກວມ 39% ຂອງປະຊາກອນ ແລະປະຊາກອນສ່ວນໃຫຍ່ອາໄສຢູ່ເຂດທົ່ງພຽງ, ຮ່ອມພູ ແລະຕົວເມືອງຫຼວງພະບາງ.ຫຼັກຖານທາງໂບຮານຄະດີສະແດງໃຫ້ເຫັນວ່າເມືອງຫຼວງພະບາງມີມາຕັ້ງແຕ່ປະມານ 8000 ປີ ກ່ອນ ຄ. ສ ອານາຈັກ ທຳອິດຂອງລາວແມ່ນອານາຈັກລານຊາງ ສ້າງຕັ້ງຂື້ນໃນສະຕະວັດທີ 14 ໂດຍເຈົ້າຟ້າງຸ່ມ ຫລັງຈາກທ່ານໄດ້ເອົາຊະນະແລະທ້ອນໂຮມອານາຈັກເປັນໜຶ່ງດຽວກັນຄື ຊຽງຂວາງ, ພູພຽງ ໂຄລາດ ແລະຫຼວງພະບາງ, ຊື່ທຳອິດຂອງອານາຈັກແມ່ນ ລາຊະອານາຈັກລານຊາງຕໍ່ມາໃນປີຄ. ສ 1357 ໄດ້ປ່ຽນຊື່ໃໝ່ ເປັນເມືອງຊຽງດົງຊຽງທອງ ໂດຍຄົນທ້ອງຖິ່ນ ຫຼັງຈາກນັ້ນບໍ່ດົນ ເຈົ້າຟ້າງຸ່ມ ໄດ້ຮັບພະພຸດທະຮູບທອງຄຳ ອົງໜື່ງທີ່ມີຊື່ວ່າພະບາງ ເປັນຂອງຂວັນຈາກກະສັດຂະແມ. ແລະກາຍເປັນເມືອງທີ່ຈະເລີນຮຸ່ງເຮືອງ ຈົນກາຍເປັນທີ່ຮູ້ກັນດີວ່າຫຼວງພະບາງ. ຫຼວງພະບາງແມ່ນນະຄອນຫຼວງຂອງອານາຈັກລານຊາງ ຈົນຮອດປີ ຄ. ສ 1560 ເຈົ້າເສດຖາທິລາດ ໄດ້ຍົກໃຫ້ວຽງຈັນເປັນນະຄອນຫຼວງແທນຫຼວງພະບາງ. (ແຕ່ຫຼວງພະບາງຍັງເປັນສູນກາງທາງສາສະໜາສຳຄັນຂອງປະເທດ) ໃນສະໄໝ ພະເຈົ້າສຸລິຍະວົງສາ, ບັນດາເມືອງຕ່າງໆໄດ້ຕິດຕໍ່ພົວພັນກັບທູດຕາເວັນຕົກ ທີ່ສ້າງຕັ້ງຂື້ນໃນກາງສະຕະວັດທີ 17 ຫຼັງຈາກພະອົງໄດ້ເສຍຊີວິດໃນປີ 1694, ອານາຈັກລານຊາງຖືກແບ່ງອອກເປັນສາມອານາຈັກຄື: ອານາຈັກວຽງຈັນ, ຈຳ ປາສັກ ແລະອານາຈັກຫຼວງພະບາງໃນທ້າຍສະຕະວັດທີ 19, ເມືອງຫຼວງພະບາງຖືກໄພຂົ່ມຂູ່ໂດຍໂຈນທຸງດຳ. ພວກໂຈນໄດ້ທຳລາຍຮູບປັ້ນພະພຸດທະຮູບ, ວັດວາອາຮາມ ແລະຫລັກຖານປະຫວັດສາດຫລາຍຢ່າງ.ພາຍໃຕ້ການປົກຄອງຂອງເຈົ້າຊີວິດ ສີສະຫວ່າງວົງ(1904 – 1959) ໄດ້ມີການເປີດໂຄງການບູລະນະ ແລະປັບປຸງ, ເຊິ່ງຫລາຍໂຄງການຍັງມີຢູ່ໃນປະຈຸບັນ. ຕຶກອາຄານທີ່ໄດ້ມີອິດທິພົນຈາກຝຣັ່ງໄດ້ເລີ້ມປະກົດຂື້ນໃນທ້າຍສັດຕະວັດ 1800, ໂດຍມີການປະສົມປະສານຂອງສະຖາປັດ ຕະຍະກຳ ລາວໄທລື້, ມຽນມາ, ຈີນ ແລະໄທ.'),
                        )
                      ],
                    )
                  ],
                ),
              ),
            ],
          ),
        ),
      ),
    );
  }
}
